Repository: mrarchis3d/RPG.API
Catalog: RPG.Identity/Resources/ServiceResources.*.resx
Languages: es

# EMAIL_ADD_OR_CHANGE_ADDRESS_BODY
source: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hello, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > We received a request to update your email address. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > This is your <strong>verification code.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > This code expires in 3 hours. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Please enter the verification code into your mobile app. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > The Ourglass Team </div></center> </div></body></html>
es: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hola, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Recibimos una solicitud para actualizar su direccion de. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Este es su <strong>codigo de verificacion.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > Este codigo expirara en 3 horas. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Por favor introduzca este codigo en su aplicacion movil. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > El equipo de Ourglass </div></center> </div></body></html>

# EMAIL_ADD_OR_CHANGE_ADDRESS_SUBJECT
source: Ourglass - Update your email address
es: Ourglass - Actualiza tu direccion de email

# ERROR_PATCH_NOT_SUPPORTED
source: Patch operation not allowed
es: Operacion de patch no permitida

# ERROR_USER_IS_COMPLETE
source: User creation is complete, cannot delete
es: La creacion del usuario se completo, el borrado esta prohibido
