Repository: mrarchis3d/RPG.API
Catalog: RPG.Identity/Resources/ServiceResources.*.resx
Languages: es

# ERROR_EMAIL_EXIST
source: This email is already taken.
es: Este correo electrónico ya está en uso.

# EMAIL_NEW_USER_BODY
source: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hello, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Thank you for creating your Ourglass account. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > This is your <strong>verification code.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > This code expires in 3 hours. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Please enter the verification code into your mobile app. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > The Ourglass Team </div></center> </div></body></html>
es: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hola, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Gracias por crear su cuenta de Ourglass. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Este es su <strong>codigo de verificacion.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > Este codigo expirara en 3 horas. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Por favor introduzca este codigo en su aplicacion movil. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > El equipo de Ourglass </div></center> </div></body></html>

# EMAIL_NEW_USER_SUBJECT
source: Verify your Ourglass account
es: Verifica tu cuenta de Ourglass

# ERROR_INPUT_REQUIRED
source: {0} is required.
es: {0} es requerido.

# ERROR_PASSWORD_NOT_MATCH
source: Please make sure passwords match.
es: Asegúrese de que las contraseñas coincidan.

# ERROR_PHONE_EXIST
source: This phone number is already taken.
es: El telefono ya existe.

# ERROR_PHONE_INVALID
source: Please enter a valid phone number.
es: Por favor ingrese un número de teléfono válido.

# SMS_NEW_USER_MESSAGE
source: Thank you for creating an Ourglass account. This is your verification code: [code]
es: Gracias por crearse una cuenta en Ourglass. Este es su código de verificación [code].

# ERROR_USERNAME_EXIST
source: This username is already taken.
es: El usuario ya existe.

# ERROR_USERNAME_INVALID
source: Please enter a Username without special characters with a minimun size of 4 and a maximum of 50.
es: Por favor Ingrese un nombre de usuario sin caracteres especiales con tamaño minimo 4 y maximo 50.

# ERROR_USERNAME_IS_CONFIRMED
source: Username {0} is already confirmed.
es: El nombre de usuario {0} ya está confirmado.

# ERROR_USERNAME_NOT_EMAIL
source: Username {0} does not have email.
es: Usuario {0} no tiene correo electrónico

# ERROR_USERNAME_NOT_EXIST
source: Username {0} does not exist.
es: El nombre de usuario {0} no existe.

# ERROR_USERNAME_NOT_PHONE
source: Username {0} does not have phone.
es: Usuario {0} no tiene telefono.

# ERROR_VERIFICATION_CODE
source: This code is invalid. Please try again.
es: Este código de verificación es incorrecto.

# ERROR_VERIFICATION_CODE_EXPIRED
source: The code has expired. Click on the link above to receive a new code
es: Este código de verificación ya caducó.

# EMAIL_RESET_PASSWORD_SUBJECT
source: Ourglass - Reset your password
es: Ourglass - Restaurar contraseña

# EMAIL_RESET_PASSWORD_BODY
source: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hello, </div><div style=" width: 406px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > We received a request to reset your password. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > This is your <strong>verification code.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom: 20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > This code expires in 3 hours. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Please enter the verification code into your mobile app. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > The Ourglass Team </div></center> </div></body></html>
es: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hola, </div><div style=" width: 406px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Recibimos una solicitud para reiniciar su contraseña. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Este es su <strong>codigo de verificacion.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom: 20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > Este codigo expirara en 3 horas. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Por favor introduzca este codigo en su aplicacion movil. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > El equipo de Ourglass </div></center> </div></body></html>

# SMS_RESET_PASSWORD_MESSAGE
source: Ourglass - This is your password reset code: [code] You can ingnore this message if you do not want to reset your password.
es: Ourglass - Este es su codigo para restablecer su contraseña [code] Usted puede desestimar el mensaje si no desea resetearla.

# ERROR_USER_NOT_CONFIRMED
source: User {0} does not have a confirmed email or phone
es: El usuario {0} no cuenta con la verificacion del telefono o email hecha

# ERROR_USER_NOT_EXIST
source: User does not exist.
es: El usuario no existe.

# ERROR_COMFIRM_PASSWORD_EMPTY
source: Re-enter your new password
es: Vuelva a ingresar su nueva contraseña

# ERROR_CURRENT_PASSWORD_EMPTY
source: Enter the current password
es: Ingresa la contraseña actual

# ERROR_NEW_PASSWORD_EMPTY
source: Enter the new password
es: Ingresa la nueva contraseña

# ERROR_INVALID_EMAIL
source: Enter a valid email address
es: Ingrese un correo electrónico válido

# ERROR_INCORRECT_PASSWORD
source: Enter a valid current password.
es: Ingrese una contraseña actual válida.

# ERROR_PASSWORD_LENGTH
source: Passwords must be at least {0} characters.
es: La contraseña debe tener al menos {0} caracteres.

# ERROR_MAX_LENGTH
source: Max {0} characters long
es: Máximo {0} caracteres de longitud

# ERROR_USERNAME_MIN_LENGTH
source: Min 4 characters long
es: Mínimo 4 caracteres de longitud

# ERROR_USERNAME_SPECIAL_CHARACTER
source: Only numbers and letters allowed
es: Solo se permiten números y letras

source: Invalid legal agreement
es: Error de validez del acuerdo legal

# EMAIL_WITHOUTUSERNAME_NEW_USER_BODY
source: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hello, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Thank you for creating your Ourglass account. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > This is your <strong>verification code.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > This code expires in 3 hours. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Please enter the verification code into your mobile app. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > The Ourglass Team </div></center> </div></body></html>
es: <html xmlns="http://www.w3.org/1999/xhtml"> <meta name="viewport" content="width=device-width, initial-scale=1.0"/> <link href="https://fonts.googleapis.com/css?family=Inter" rel="stylesheet"/> <head> </head> <body> <div style=" margin: 0; height: 100%; background-color: rgba(41, 41, 44, 1); border-radius: 10px; " > <center> <div style=" box-sizing: border-box; padding: 20px; height: 70px; background: linear-gradient(98.31deg, #7b61ff 49.84%, #3c39ef 100%); border-bottom: 2px solid rgba(255, 255, 255, 0.5); border-top-left-radius: 10px; border-top-right-radius: 10px; " > <div style=" font-family: 'Inter'; font-style: normal; font-weight: lighter; font-size: 28px; color: white; " > Ourglass </div></div><div style=" width: 68px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #ffffff; padding-top: 40px; padding-bottom: 40px; " > Hola, </div><div style=" width: 306px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Gracias por crear su cuenta de Ourglass. </div><div style=" width: 200px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; padding-bottom: 20px; " > Este es su <strong>codigo de verificacion.</strong> </div><div style=" display: flex; flex-direction: column; align-items: center; padding: 20px; gap: 6px; width: 309px; height: 90px; background: #222222; border-radius: 10px; justify-content: center; margin: 0px auto; " > <table style=" border-spacing: 10px; border-collapse: separate; padding-bottom:20px; padding-right: 60px; padding-left: 50px; " > <tr> <td> <div style=" width: 195px; height: 29px; font-family: 'Inter'; font-style: normal; font-weight: 700; font-size: 24px; line-height: 29px; text-align: center; color: #7b61ff; " > [d1][d2][d3][d4] </div></td></tr><tr> <td> <div style=" width: 163px; height: 15px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 12px; line-height: 15px; text-align: center; color: #918bac; margin: 0px auto; " > Este codigo expirara en 3 horas. </div></td></tr></table> </div><div style=" padding-top: 20px; padding-bottom: 40px; width: 223px; height: 34px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #ffffff; " > Por favor introduzca este codigo en su aplicacion movil. </div><div style=" width: 128px; height: 17px; font-family: 'Inter'; font-style: normal; font-weight: 400; font-size: 14px; line-height: 17px; text-align: center; color: #494950; padding-bottom: 40px; " > El equipo de Ourglass </div></center> </div></body></html>

# ERROR_INVALID_INVITECODE
source: Invalid invite code
es: Código de invitación no válido

# INVITECODE_REQUIRED
source: Invitation code required
es: Código de invitación requerido

# ERROR_INVITATION_CODE_USAGE_LIMIT
source: This invitation code has already reached its usage limit.
es: Este código de invitación ya ha llegado a su límite de uso
